01Hub/fbedit/ShowMap/STM32_Sonar/main.c
/*******************************************************************************
* File Name          : main.c
* Author             : KetilO
* Version            : V1.1.0
* Date               : 03/15/2012
* Description        : Main program body
********************************************************************************

/* Includes ------------------------------------------------------------------*/
#include "stm32f10x_lib.h"

/* Private define ------------------------------------------------------------*/
// Uncomment the clock speed you will be using
//#define STM32Clock24MHz
//#define STM32Clock28MHz
//#define STM32Clock32MHz
#define STM32Clock40MHz
//#define STM32Clock48MHz
//#define STM32Clock56MHz

#define MAXECHO           ((u16)512)
#define ADC1_ICDR_Address ((u32)0x4001243C)

typedef struct
{
  vu8 Start;                                    // 0x20000000 0=Wait/Done, 1=Start, 2=In progress
  u8 PingPulses;                                // 0x20000001 Number of ping pulses (0-255)
  u8 PingTimer;                                 // 0x20000002 TIM1 auto reload value, ping frequency
  u8 RangeInx;                                  // 0x20000003 Current range index
  u16 PixelTimer;                               // 0x20000004 TIM2 auto reload value, sample rate
  vu16 EchoIndex;                               // 0x20000006 Current index into EchoArray
  u16 ADCBatt;                                  // 0x20000008 Battery
  u16 ADCWaterTemp;                             // 0x2000000A Water temprature
  u16 ADCAirTemp;                               // 0x2000000C Air temprature
  vu16 GPSHead;                                 // 0x2000000E GPSArray head, index into GPSArray
  u8 EchoArray[MAXECHO];                        // 0x20000010 Echo array
  u16 GainArray[MAXECHO];                       // 0x20000210 Gain array
  u16 GainInit[18];                             // 0x20000610 Gain setup array, first half word is initial gain
  u8 GPSArray[512];                             // 0x20000034 GPS array, received GPS NMEA 0183 messages
}STM32_SonarTypeDef;

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
static STM32_SonarTypeDef STM32_Sonar;          // 0x20000000
vu8 BlueLED;                                    // Current state of the blue led
vu16 Ping;                                      // Value to output to PA1 and PA2 pins

/* Private function prototypes -----------------------------------------------*/
void RCC_Configuration(void);
void GPIO_Configuration(void);
void NVIC_Configuration(void);
void ADC_Startup(void);
void ADC_Configuration(void);
void TIM1_Configuration(void);
void TIM2_Configuration(void);
void TIM3_Configuration(void);
void USART_Configuration(u16 Baud);
u16 GetADCValue(u8 Channel);
void rs232_puts(char *str);
void rs232_gets(char *str);
void GainSetup(void);

/* Private functions ---------------------------------------------------------*/

/*******************************************************************************
* Function Name  : main
* Description    : Main program
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
int main(void)
{
  u32 i;
  u32* ADC;
  u8 Echo;
  /* System clocks configuration */
  RCC_Configuration();
  /* NVIC configuration */
  NVIC_Configuration();
  /* GPIO configuration */
  GPIO_Configuration();
  /* TIM1 configuration */
  TIM1_Configuration();
  /* TIM3 configuration */
  TIM3_Configuration();
  /* ADC1 configuration */
  ADC_Startup();
  /* ADC1 injected channel configuration */
  ADC_Configuration();
  /* Enable DAC channel1 */
  DAC->CR = 0x1;
  /* Set the DAC to output lowest gain */
  DAC->DHR12R1 = (u16)0x0;
  /* Setup USART1 4800 baud */
  USART_Configuration(4800);
  /* Wait until GPS module has started up */
  i = 0;
  while (i++ < 20000000)
  {
  }
  if (GPIO_ReadInputDataBit(GPIOA,GPIO_Pin_0))
  {
    /* Enable TIM3 */
    TIM_Cmd(TIM3, ENABLE);
  }
  /* Switch to NMEA protocol at 4800,8,N,1 */
  rs232_puts("$PSRF100,1,4800,8,1,0*0E\r\n\0");
  /* Enable GGA message, rate 5 seconds */
  rs232_puts("$PSRF103,00,00,05,00*20\r\n\0");
  /* Disable GLL message */
  rs232_puts("$PSRF103,01,00,00,01*25\r\n\0");
  /* Disable GSA message */
  rs232_puts("$PSRF103,02,00,00,01*26\r\n\0");
  /* Enable GSV message, rate 5 seconds */
  rs232_puts("$PSRF103,03,00,05,00*23\r\n\0");
  /* Ensable RMC message, rate 1 second */
  rs232_puts("$PSRF103,04,00,01,00*20\r\n\0");
  /* Disable VTG message */
  rs232_puts("$PSRF103,05,00,00,01*21\r\n\0");

  while (1)
  {
    if (STM32_Sonar.Start == 1)
    {
      STM32_Sonar.Start = 2;
      /* Toggle blue led */
      if (BlueLED)
      {
        GPIO_WriteBit(GPIOC, GPIO_Pin_8, Bit_RESET);
        BlueLED = 0;
      }
      else
      {
        GPIO_WriteBit(GPIOC, GPIO_Pin_8, Bit_SET);
        BlueLED = 1;
      }
      /* Setup gain array */
      GainSetup();
      /* Clear the echo array */
      i = 1;
      while (i < MAXECHO)
      {
        STM32_Sonar.EchoArray[i++] = 0;
      }
      /* Read battery */
      STM32_Sonar.ADCBatt = GetADCValue(ADC_Channel_5);
      /* Read water temprature */
      STM32_Sonar.ADCWaterTemp = GetADCValue(ADC_Channel_6);
      /* Read air temprature */
      STM32_Sonar.ADCAirTemp = GetADCValue(ADC_Channel_7);
      /* Enable ADC injected channel */
      ADC_AutoInjectedConvCmd(ADC1, ENABLE);
      /* Store the current range as the first byte in the echo array */
      STM32_Sonar.EchoArray[0] = STM32_Sonar.RangeInx;
      /* Reset echo index */
      STM32_Sonar.EchoIndex = 1;
      /* Set the TIM1 Autoreload value */
      TIM1->ARR = STM32_Sonar.PingTimer;
      /* Set the TIM3 Autoreload value */
      TIM3->ARR = STM32_Sonar.PingTimer*2+1;
      /* Reset TIM1 count */
      TIM1->CNT = 0;
      /* Reset TIM3 count */
      TIM3->CNT = 0;
      /* Set TIM1 repetirion counter */
      TIM1->RCR = 0;
      /* Init Ping */
      Ping = 0x2;
      /* Enable TIM1 */
      TIM_Cmd(TIM1, ENABLE);
      /* Get the Echo array */
      while (STM32_Sonar.Start)
      {
        /* To eliminate the need for an advanced AM demodulator the largest */ 
        /* ADC reading is stored in its echo array element */
        /* Get echo */
        ADC = ( (u32 *) ADC1_ICDR_Address);
        Echo = (u8) ( (u16) (*(vu32*) (((*(u32*)&ADC)))) >> 4);
        /* If echo larger than previous echo, update the echo array */
        if (Echo > STM32_Sonar.EchoArray[STM32_Sonar.EchoIndex])
        {
          STM32_Sonar.EchoArray[STM32_Sonar.EchoIndex] = Echo;
        }
      }
      /* Done, Disable TIM2 */
      TIM2->CR1 = 0;
      /* Disable ADC injected channel */
      ADC_AutoInjectedConvCmd(ADC1, DISABLE);
      /* Set the DAC to output lowest gain */
      DAC->DHR12R1 = (u16)0x0;
    }
    i = 0;
    while (i++ < 1000)
    {
    }
  }
}

